Revit 2027 API
MechanicalSystem.GetFlow Method
 Gets the flow of this mechanical system.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetFlow()
Public Function GetFlow As Double
public:
double GetFlow()
member GetFlow : unit -> float
Return Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  The flow can not be calculated for this system.
Remarks
 The system flow is calculated in the non-blocking evaluation framework. The caller may set up callbacks that react to the asynchronous calculation results. If no callback is set up (e.g, called from third-party applications), the calculation is automatically switched to synchronous calculation so the caller can access the up-to-date result. Similarly, the public method get_ParameterValue(BuiltInParameter.RBS_DUCT_FLOW_PARAM) has the same behavior. Due to this change, the parameter RBS_DUCT_FLOW_PARAM no longer supports dynamic model update.
See Also
Reference
MechanicalSystem Class
Autodesk.Revit.DB.Mechanical Namespace